{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 1,
    "Custom": null,
    "Description": "When i open the created documents with Libre Office 4 the table of contents shows just a grey box with no items. Same happens at different computers and operating systems. \r\nI attached a picture of the created documentation created from the htmltodocx example on htmltodocx/documentation/index.php and the created documentation itself.\r\n\r\n",
    "LastUpdatedDate": "2013-06-07T10:49:39.56-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "htmltodocx",
    "ReportedDate": "2013-06-04T04:20:10.777-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Table of contents is not working in Libreoffice 4",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 483
  },
  "FileAttachments": [
    {
      "FileId": 689333,
      "FileName": "11.png",
      "DownloadUrl": ".\\689333"
    },
    {
      "FileId": 689337,
      "FileName": "htmltodocx-documentation (6).docx",
      "DownloadUrl": ".\\689337"
    }
  ],
  "Comments": [
    {
      "Message": "Hi ExpectZero\n\nThis seems to open correctly with Word 2010 and with Libre Office  3.6.4.3. I have just upgraded to Libre Office 4.0.3.3, and, yes, as you say, the table of contents field now no longer displays properly. If you save it with Word first and then open with Libre Office 4, the table of contents will now display correctly.\n\nI suspect this will be something to do with what is in the document.xml file - or possibly another file, which makes up a docx file (you can see these files by opening the docx file with an archive utility - or in Windows you could just change the extension from docx to zip and double click on it).\n\nIt will be a case of comparing the files within this collection before and after opening and saving the original file with Word to enable the appropriate modification to be made to PHPWord. I carried out a similar process to solve an issue where tables generated by PHPWord weren't displaying properly in Libre Office see: https://phpword.codeplex.com/workitem/31#PostedByLink2\n",
      "PostedDate": "2013-06-07T10:49:39.56-07:00",
      "Id": 102442
    }
  ]
}